In [1]:
person = {
    'first':'Hussein' , 
    'last':'Sarea',
    'email':'zzzsdsd@dskd.com',
}

In [2]:
people = {
    'first':['Hussein'],
    'last':['Sarea'],
    'email':['zzzsdsd@dskd.com']
}

In [3]:
people = {
    'first':['Hussein' , 'Moataz' , 'Ekram'],
    'last':['Sarea' , 'Ahmed' , 'Sarea'],
    'email':['zzzsdsd@dskd.com' , 'dsd@dsx.com' , 'zzz@dskd.com']
}

In [4]:
people['email']

['zzzsdsd@dskd.com', 'dsd@dsx.com', 'zzz@dskd.com']

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame(people)

In [7]:
df

     first   last             email
0  Hussein  Sarea  zzzsdsd@dskd.com
1   Moataz  Ahmed       dsd@dsx.com
2    Ekram  Sarea      zzz@dskd.com

In [8]:
df['last']
type(df['last']) #Series

pandas.core.series.Series

In [9]:
df[ ['first' , 'last'] ] #Accessing multiple column , 
type(df[ ['first' , 'last'] ]) #DataFrame

pandas.core.frame.DataFrame

In [10]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [11]:
df.iloc[0:2 , 2]

0    zzzsdsd@dskd.com
1         dsd@dsx.com
Name: email, dtype: object

In [12]:
df.iloc[ [0 , 1] ] #Selecting multiple rows

     first   last             email
0  Hussein  Sarea  zzzsdsd@dskd.com
1   Moataz  Ahmed       dsd@dsx.com

In [13]:
df.iloc[ [0 , 1] , 2] #Selecting multiple rows and specific column

0    zzzsdsd@dskd.com
1         dsd@dsx.com
Name: email, dtype: object

In [14]:
df.loc[ [0 , 2] , ['first' , 'email']]

     first             email
0  Hussein  zzzsdsd@dskd.com
2    Ekram      zzz@dskd.com

In [15]:
df['email']

0    zzzsdsd@dskd.com
1         dsd@dsx.com
2        zzz@dskd.com
Name: email, dtype: object

In [16]:
df.set_index('email')

                    first   last
email
zzzsdsd@dskd.com  Hussein  Sarea
dsd@dsx.com        Moataz  Ahmed
zzz@dskd.com        Ekram  Sarea

In [19]:
df.set_index('email' , inplace=True)

In [21]:
df.index

Index(['zzzsdsd@dskd.com', 'dsd@dsx.com', 'zzz@dskd.com'], dtype='object', name='email')

In [25]:
df.loc['zzzsdsd@dskd.com' , 'first']

'Hussein'

In [30]:
df.iloc[0]

first    Hussein
last       Sarea
Name: zzzsdsd@dskd.com, dtype: object

In [33]:
df.reset_index(inplace=True)

In [34]:
df

              email    first   last
0  zzzsdsd@dskd.com  Hussein  Sarea
1       dsd@dsx.com   Moataz  Ahmed
2      zzz@dskd.com    Ekram  Sarea

In [39]:
type(df['last'] == 'Sarea') #Series

pandas.core.series.Series

In [40]:
filt = (df['last'] == 'Sarea')

In [52]:
df[filt]

              email    first   last
0  zzzsdsd@dskd.com  Hussein  Sarea
2      zzz@dskd.com    Ekram  Sarea

In [61]:
type( df.loc[ filt , 'first'] ) #Series
type( df.loc[ filt , ['first' , 'email'] ] ) #DataFrame

df.loc[filt , ['first' , 'email']]

     first             email
0  Hussein  zzzsdsd@dskd.com
2    Ekram      zzz@dskd.com

In [63]:
filt = ( df['first'] == 'Hussein' ) & ( df['last'] == 'Sarea' )
df.loc[filt , 'email']

0    zzzsdsd@dskd.com
Name: email, dtype: object

In [64]:
filt = ( df['first'] == 'Hussein' ) | ( df['last'] == 'Ahmed' )
df.loc[filt , 'email']

0    zzzsdsd@dskd.com
1         dsd@dsx.com
Name: email, dtype: object

In [66]:
filt = ( df['first'] == 'Hussein' ) & ( df['last'] == 'Sarea' )
df.loc[~filt , 'email']

1     dsd@dsx.com
2    zzz@dskd.com
Name: email, dtype: object